Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFG064.PIC
      <edc:SFRDef edc:_addr="0x1F801340" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="11" edc:access="----------------n---r----nnnnnnn" edc:cname="PB5DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB5DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801350" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F801360" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="12" edc:access="----------------n---r----nnnnnnn" edc:cname="PB7DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB7DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801370" edc:_begin="0xb0" edc:_end="0xc0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="13" edc:access="----------------n---r----nnnnnnn" edc:cname="PB8DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB8DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801380" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F8013C0" edc:_begin="0xc0" edc:_end="0xe0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="14" edc:access="------------nnnn-----nnn-----nnn" edc:cname="SLEWCON" edc:desc="" edc:impl="0xf0707" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------0000-----000-----000" edc:name="SLEWCON" edc:nzwidth="32" edc:por="------------0000-----000-----000" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DNEN" edc:desc="" edc:mask="0x1" edc:name="DNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UPEN" edc:desc="" edc:mask="0x1" edc:name="UPEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SLWDIV" edc:mask="0x7" edc:name="SLWDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SYSDIV" edc:mask="0xf" edc:name="SYSDIV" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8013D0" edc:_begin="0xc0" edc:_end="0xe0" edc:_modsrc="DOS-02823_clk_cru_upb_v2.Module" edc:_refcount="14" edc:access="--------------------------rr-rnr" edc:cname="CLKSTAT" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------uu-uuu" edc:name="CLKSTAT" edc:nzwidth="32" edc:por="--------------------------00-0x0" edc:portals="CLR SET INV" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FRCRDY" edc:mask="0x1" edc:name="FRCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPDIVRDY" edc:mask="0x1" edc:name="SPDIVRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSCRDY" edc:mask="0x1" edc:name="POSCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SOSCRDY" edc:mask="0x1" edc:name="SOSCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRCRDY" edc:mask="0x1" edc:name="LPRCRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVSPLLRDY" edc:mask="0x1" edc:name="DIVSPLLRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8013E0" edc:offset="0x24"/>
      <edc:SFRDef edc:_addr="0x1F801404" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="1" edc:access="----------------------------nnnn" edc:cname="INT1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INT1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT1R" edc:desc="" edc:mask="0xf" edc:name="INT1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801408" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="2" edc:access="----------------------------nnnn" edc:cname="INT2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INT2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT2R" edc:desc="" edc:mask="0xf" edc:name="INT2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80140C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="3" edc:access="----------------------------nnnn" edc:cname="INT3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INT3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT3R" edc:desc="" edc:mask="0xf" edc:name="INT3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801410" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="4" edc:access="----------------------------nnnn" edc:cname="INT4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INT4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT4R" edc:desc="" edc:mask="0xf" edc:name="INT4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801414" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F801418" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="5" edc:access="----------------------------nnnn" edc:cname="T2CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="T2CKR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T2CKR" edc:desc="" edc:mask="0xf" edc:name="T2CKR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80141C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="6" edc:access="----------------------------nnnn" edc:cname="T3CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="T3CKR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T3CKR" edc:desc="" edc:mask="0xf" edc:name="T3CKR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
