Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFG064.PIC
      <edc:SFRDef edc:_addr="0x1F810878" edc:_begin="0x874" edc:_end="0x88c" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="18" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF206" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF190" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81087C" edc:_begin="0x874" edc:_end="0x88c" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="18" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF207" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF190" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810880" edc:_begin="0x874" edc:_end="0x88c" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="18" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF208" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF190" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810884" edc:_begin="0x874" edc:_end="0x88c" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="18" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF209" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF190" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810888" edc:_begin="0x874" edc:_end="0x88c" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="18" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF210" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF190" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F81088C" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F810894" edc:_begin="0x894" edc:_end="0x898" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="19" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF213" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF190" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810898" edc:offset="0x768"/>
      <edc:SFRDef edc:_addr="0x1F811000" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="----------------nn-nn-----------" edc:cname="DMACON" edc:desc="" edc:impl="0xd800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00-00-----------" edc:name="DMACON" edc:nzwidth="32" edc:por="----------------00-00-----------" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="DMABUSY" edc:desc="" edc:mask="0x1" edc:name="DMABUSY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SUSPEND" edc:desc="" edc:mask="0x1" edc:name="SUSPEND" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="DMA" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811010" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="r----------------------------rrr" edc:cname="DMASTAT" edc:desc="" edc:impl="0x80000007" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----------------------------000" edc:name="DMASTAT" edc:nzwidth="32" edc:por="0----------------------------000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACH" edc:desc="" edc:mask="0x7" edc:name="DMACH" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="15"/>
            <edc:SFRFieldDef edc:cname="RDWR" edc:desc="" edc:mask="0x1" edc:name="RDWR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811020" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMAADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DMAADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811030" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="--nnn--n-----------nnnnnnnn--nnn" edc:cname="DCRCCON" edc:desc="" edc:impl="0x39001fe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000--0-----------00000000--000" edc:name="DCRCCON" edc:nzwidth="32" edc:por="--000--0-----------00000000--000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CRCCH" edc:desc="" edc:mask="0x7" edc:name="CRCCH" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CRCTYP" edc:desc="" edc:mask="0x1" edc:name="CRCTYP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRCAPP" edc:desc="" edc:mask="0x1" edc:name="CRCAPP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRCEN" edc:desc="" edc:mask="0x1" edc:name="CRCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0x1f" edc:name="PLEN" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="BITO" edc:desc="" edc:mask="0x1" edc:name="BITO" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="WBO" edc:desc="" edc:mask="0x1" edc:name="WBO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BYTO" edc:desc="" edc:mask="0x3" edc:name="BYTO" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811040" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCRCDATA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DCRCDATA" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCRCDATA" edc:desc="" edc:mask="0xffffffff" edc:name="DCRCDATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
