Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFG064.PIC
      <edc:SFRDef edc:_addr="0x1F860690" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="----------------------nnnn------" edc:cname="CNSTATG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff03c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000------" edc:name="CNSTATG" edc:nzwidth="0x20" edc:por="----------------------0000------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG6" edc:desc="" edc:mask="0x1" edc:name="CNSTATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG7" edc:desc="" edc:mask="0x1" edc:name="CNSTATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG8" edc:desc="" edc:mask="0x1" edc:name="CNSTATG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG9" edc:desc="" edc:mask="0x1" edc:name="CNSTATG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="----------------------nnnn------" edc:cname="CNNEG" edc:desc="" edc:impl="0x3c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000------" edc:name="CNNEG" edc:nzwidth="32" edc:por="----------------------0000------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEG6" edc:mask="0x1" edc:name="CNNEG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG7" edc:mask="0x1" edc:name="CNNEG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG8" edc:mask="0x1" edc:name="CNNEG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEG9" edc:mask="0x1" edc:name="CNNEG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="----------------------nnnn------" edc:cname="CNFG" edc:desc="" edc:impl="0x3c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000------" edc:name="CNFG" edc:nzwidth="32" edc:por="----------------------0000------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFG6" edc:mask="0x1" edc:name="CNFG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG7" edc:mask="0x1" edc:name="CNFG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG8" edc:mask="0x1" edc:name="CNFG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG9" edc:mask="0x1" edc:name="CNFG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="----------------------n--n------" edc:cname="SRCON0G" edc:desc="" edc:impl="0x240" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0--0------" edc:name="SRCON0G" edc:nzwidth="32" edc:por="----------------------0--0------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0G6" edc:mask="0x1" edc:name="SR0G6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0G9" edc:mask="0x1" edc:name="SR0G9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8606D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="----------------------n--n------" edc:cname="SRCON1G" edc:desc="" edc:impl="0x240" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0--0------" edc:name="SRCON1G" edc:nzwidth="32" edc:por="----------------------0--0------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1G6" edc:mask="0x1" edc:name="SR1G6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1G9" edc:mask="0x1" edc:name="SR1G9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f880000" edc:endaddr="0x1f885000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb5_std">
      <edc:AdjustPoint edc:_addr="0x1F880000" edc:offset="0x2000"/>
      <edc:SFRDef edc:_addr="0x1F882000" edc:_begin="0x0" edc:_end="0xf0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnn---nnn--n---n" edc:cname="ETHCON1" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000xxx000xx0xxx0" edc:name="ETHCON1" edc:nzwidth="0x20" edc:por="0000000000000000000xxx000xx0xxx0" edc:portals="CLR SET INV" ltx:baseofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUFCDEC" edc:desc="" edc:mask="0x1" edc:name="BUFCDEC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="MANFC" edc:desc="" edc:mask="0x1" edc:name="MANFC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="AUTOFC" edc:desc="" edc:mask="0x1" edc:name="AUTOFC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="" edc:mask="0x1" edc:name="RXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRTS" edc:desc="" edc:mask="0x1" edc:name="TXRTS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTV" edc:desc="" edc:mask="0xffff" edc:name="PTV" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ETHERNET CONTROLLER" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882010" edc:_begin="0x0" edc:_end="0xf0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="---------------------nnnnnnn----" edc:cname="ETHCON2" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxx0000000xxxx" edc:name="ETHCON2" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxx0000000xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RXBUF_SZ" edc:desc="" edc:mask="0x7f" edc:name="RXBUF_SZ" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
